import { HttpClient } from '@angular/common/http';
import { Injectable } from '@angular/core';

/*
  Generated class for the ReceiptsProvider provider.

  See https://angular.io/guide/dependency-injection for more info on providers
  and Angular DI.
*/
@Injectable()
export class ReceiptsProvider {

  // receipt_image_count = [5, 4, 4, 5, 6, 5, 6, 5, 4, 5];

  // 메뉴 사진
  receipt_00_position = [
    [28, 17, 35], // 쌍별이 아약 토스트
    [33, 17, 30], // 벅스 블루베리 크림치즈 토스트
    [26, 15, 38], // 장수애 콘치즈
    [28, 11, 38], // 수벌번데기 시리얼바
    [29, 20, 35], // 노오븐 티라미수
    [35, 18, 37], // 비건참치 풀무치 카나페
    [29, 17, 41], // 누애 녹차 쉐이크
    [28, 11, 37], // 고소애 피자
    [30,  4, 44], // 꽃벵이 동충하초 두부샐러드
    [28, 12, 38], // 슈퍼 밀웜 딸기바나나 쉐이크
  ];

  //글자
  receipt_images_position = [
    // left top
    [[ 5,  2, 40], [10, 55, 20], [60,  2, 30], [65, 34, 25], [58, 70, 20],],                  // 쌍별이 아약 토스트
    [[ 5,  2, 30], [ 7, 62, 25], [60,  2, 25], [65, 50, 30],],                                  // 벅스 블루베리 크림치즈 토스트
    [[ 9,  4, 40], [ 9, 59, 30], [60,  4, 32], [60, 55, 35],],                                  // 장수애 콘치즈
    [[ 5,  4, 20], [ 3, 50, 33], [55,  3, 40], [63, 43, 32], [52, 71, 25],],                  // 수벌번데기 시리얼바
    [[ 6,  2, 34], [ 6, 34, 25], [6,  70, 25], [60,  2, 31], [63, 34, 25], [58, 71, 32],],   // 노오븐 티라미수
    [[ 5,  4, 30], [ 5, 37, 30], [ 5, 70, 22], [61,  4, 35], [60, 64, 29],],                         // 비건참치 풀무치 카나페
    [[13,  2, 27], [ 5, 39, 18], [10, 71, 18], [65,  2, 13], [65, 37, 20], [65, 75, 14],],           // 누애 녹차 쉐이크
    [[ 6,  2, 29], [ 8, 49, 19], [60,  2, 30], [65, 34, 25], [57, 69, 28],],                   // 고소애 피자
    [[ 5,  2, 24], [ 5, 59, 26], [69,  2, 22], [49, 71, 32],],                                  // 꽃벵이 동충하초 두부샐러드
    [[ 7,  4, 24], [ 7, 66, 28], [60,  2, 30],  [65, 34, 21], [63, 73, 14],],                    // 슈퍼 밀웜 딸기바나나 쉐이크
  ];

  //아이콘
  receipt_icons_position = [
    // left top
    [[ 5,  6, 25], [ 9, 67, 20], [65,  4, 20], [66, 39, 22], [79, 71, 17], [92, 69,  7],],               // 쌍별이 아약 토스트
    [[12, 15, 18], [30, 69, 16], [72, 14, 17], [70, 66, 19], [86, 62,  7],],                           // 벅스 블루베리 크림치즈 토스트
    [[12, 10, 20], [17, 70, 18], [61,  0, 31], [90, 14,  7], [70, 62, 20],],                             // 장수애 콘치즈
    [[ 9, 13, 15], [ 5, 66, 17], [25, 66, 18], [62,  3, 28], [75, 45, 22], [76, 72, 21],],               // 수벌번데기 시리얼바
    [[ 1,  5, 19], [17,  7, 18], [ 7, 38, 22], [ 9, 74, 22], [65,  5, 20], [64, 31, 27], [66, 76, 30],],    // 노오븐 티라미수
    [[12,  6, 21], [10, 33, 24], [28, 64, 24], [63, 12, 30], [75, 62, 22],],                             // 비건참치 풀무치 카나페
    [[16,  8, 19], [11, 39, 19], [13, 79, 15], [74,  0, 22], [67, 44, 18], [78, 74, 18],],               // 누애 녹차 쉐이크
    [[12, 13, 17], [ 9, 67, 20], [67,  8, 17], [66, 35, 24], [71, 71, 20], [87, 73,  7],],               // 고소애 피자
    [[ 6,  9, 20], [ 8, 60, 25], [72, 10, 20], [73, 64, 20],],                                        // 꽃벵이 동충하초 두부샐러드
    [[ 9, 12, 20], [ 9, 67, 22], [65,  8, 16], [73, 40, 20], [75, 71, 18],],                          // 슈퍼 밀웜 딸기바나나 쉐이크
  ];

  // 메뉴 이름
  // receipt_title_position = [
  //   // left top
  //   [1170, 1479], // 쌍별이 아약 토스트
  //   [924, 1479], // 벅스 블루베리 크림치즈 토스트
  //   [1274, 1479], // 장수애 콘치즈
  //   [1134, 1479], // 수벌번데기 시리얼바
  //   [1230, 1479], // 노오븐 티라미수
  //   [1114, 1479], // 비건참치 풀무치 카나페
  //   [1214, 1479], // 누애 녹차 쉐이크
  //   [1314, 1479], // 고소애 피자
  //   [1050, 1479], // 꽃벵이 동충하초 두부샐러드
  //   [1020, 1479], // 슈퍼 밀웜 딸기바나나 쉐이크
  // ]

  /*
    .recipe1{z-index: 2; left: 783px; top: 473px;}
    .recipe2{z-index: 2; left: 783px; top: 984px;}
    .recipe3{z-index: 2; left: 1801.5px; top: 475px;}
    .recipe4{z-index: 2; left: 1890.5px; top: 800px;}
    .recipe5{z-index: 2; left: 1784.5px; top: 1114px;}

    .icon0{left: 1254px; top: 546px;}

    .icon1{left: 842px; top: 594px;}
    .icon2{left: 1052px; top: 1037px;}
    .icon3{left: 1871px; top: 553px;}
    .icon4{left: 1911px; top: 811px;}
    .icon5{left: 1846px; top: 1166px;}
    .icon5-1{left: 2092px; top: 1192px;}
  */

  constructor(public http: HttpClient) {
    console.log('Hello ReceiptsProvider Provider');
  }

  get_receipts_positions(num)
  {
    var result = [];
    result.push(this.receipt_00_position[num - 1]);
    result.push(this.receipt_images_position[num - 1]);
    result.push(this.receipt_icons_position[num - 1]);
    // result.push(this.receipt_title_position[num - 1]);
    return result;
  }
}
