import { HttpClient } from '@angular/common/http';
import { Injectable } from '@angular/core';

/*
  Generated class for the ReceiptsProvider provider.

  See https://angular.io/guide/dependency-injection for more info on providers
  and Angular DI.
*/
@Injectable()
export class ReceiptsProvider {

  // receipt_image_count = [5, 4, 4, 5, 6, 5, 6, 5, 4, 5];

  // 메뉴 사진
  receipt_00_position = [
    [1304, 646], // 쌍별이 아약 토스트
    [1254, 546], // 벅스 블루베리 크림치즈 토스트
    [1274, 566], // 장수애 콘치즈
    [1154, 516], // 수벌번데기 시리얼바
    [1254, 606], // 노오븐 티라미수
    [1304, 506], // 비건참치 풀무치 카나페
    [1224, 546], // 누애 녹차 쉐이크
    [1254, 546], // 고소애 피자
    [1304, 550], // 꽃벵이 동충하초 두부샐러드
    [1280, 550], // 슈퍼 밀웜 딸기바나나 쉐이크
  ];

  //글자
  receipt_images_position = [
    [[783, 473], [783, 984], [1801.5, 475], [1890.5, 780], [1784.5, 1134],],                  // 쌍별이 아약 토스트
    [[783, 473], [783, 924], [1801.5, 475], [1870.5, 950],],                                  // 벅스 블루베리 크림치즈 토스트
    [[783, 473], [783, 884], [1801.5, 475], [1790.5, 910],],                                  // 장수애 콘치즈
    [[733.5, 473], [733.5, 904], [1671.5, 475], [1740.5, 800], [1734.5, 1114],],                  // 수벌번데기 시리얼바
    [[703.5, 473], [703.5, 804], [803.5, 1150], [1590.5, 453], [1784.5, 804], [1704.5, 1100],],   // 노오븐 티라미수
    [[783, 473], [783, 904], [1400, 940], [1690, 450], [1800, 814],],                         // 비건참치 풀무치 카나페
    [[853, 473], [783, 804], [853, 1100], [1850, 473], [1900, 804], [1850, 1100],],           // 누애 녹차 쉐이크
    [[783, 473], [783, 984], [1801.5, 475], [1890, 800], [1784.5, 1114],],                   // 고소애 피자
    [[783, 473], [783, 904], [1801.5, 475], [1800, 970],],                                  // 꽃벵이 동충하초 두부샐러드
    [[783, 473], [783, 884], [1801.5, 475], [1890, 800], [1784.5, 1114],],                    // 슈퍼 밀웜 딸기바나나 쉐이크
  ];

  //아이콘
  receipt_icons_position = [
    [[842,534], [952,1150], [1871,503], [1911,831], [1846,1236], [2072,1232],],               // 쌍별이 아약 토스트
    [[892,594], [902,1107], [1911,603], [1911,1111], [2206,1066],],                           // 벅스 블루베리 크림치즈 토스트
    [[842,544], [902,1007], [1801,453], [2271,581], [1906,966],],                             // 장수애 콘치즈
    [[842,564], [852,1097], [1871,563], [1861,771], [1706,1186], [1992,1172],],               // 수벌번데기 시리얼바
    [[842,524], [842,867], [942,1220], [1891,501], [1906,836], [1602,1130], [1992,1230],],    // 노오븐 티라미수
    [[812,464], [852,837], [1360,1050], [1801,523], [1906,866],],                             // 비건참치 풀무치 카나페
    [[952,534], [902,840], [950,1150], [1950,470], [2000,860], [1950,1170],],               // 누애 녹차 쉐이크
    [[842,594], [1052,1037], [1871,553], [1911,811], [1846,1166], [2092,1192],],               // 고소애 피자
    [[842,540], [852,927], [1871,553], [1850,1030],],                                        // 꽃벵이 동충하초 두부샐러드
    [[842,555], [850,937], [2000,540], [2050,870], [1900,1166],],                          // 슈퍼 밀웜 딸기바나나 쉐이크
  ];

  // 메뉴 이름
  receipt_title_position = [
    [1170, 1479], // 쌍별이 아약 토스트
    [924, 1479], // 벅스 블루베리 크림치즈 토스트
    [1274, 1479], // 장수애 콘치즈
    [1134, 1479], // 수벌번데기 시리얼바
    [1230, 1479], // 노오븐 티라미수
    [1114, 1479], // 비건참치 풀무치 카나페
    [1214, 1479], // 누애 녹차 쉐이크
    [1314, 1479], // 고소애 피자
    [1050, 1479], // 꽃벵이 동충하초 두부샐러드
    [1020, 1479], // 슈퍼 밀웜 딸기바나나 쉐이크
  ]

  /*
    .recipe1{z-index: 2; left: 783px; top: 473px;}
    .recipe2{z-index: 2; left: 783px; top: 984px;}
    .recipe3{z-index: 2; left: 1801.5px; top: 475px;}
    .recipe4{z-index: 2; left: 1890.5px; top: 800px;}
    .recipe5{z-index: 2; left: 1784.5px; top: 1114px;}

    .icon0{left: 1254px; top: 546px;}

    .icon1{left: 842px; top: 594px;}
    .icon2{left: 1052px; top: 1037px;}
    .icon3{left: 1871px; top: 553px;}
    .icon4{left: 1911px; top: 811px;}
    .icon5{left: 1846px; top: 1166px;}
    .icon5-1{left: 2092px; top: 1192px;}
  */

  constructor(public http: HttpClient) {
    console.log('Hello ReceiptsProvider Provider');
  }

  get_receipts_positions(num)
  {
    var result = [];
    result.push(this.receipt_00_position[num - 1]);
    result.push(this.receipt_images_position[num - 1]);
    result.push(this.receipt_icons_position[num - 1]);
    result.push(this.receipt_title_position[num - 1]);
    return result;
  }
}
